""" Создать список и заполнить его элементами различных типов данных.
Реализовать провеоку типа данных каждого элемента.
"""
print('Hello')
my_list = [10, "april", 2.75, False, None]
print(type(my_list[0]))
print(type(my_list[1]))
print(type(my_list[2]))
print(type(my_list[3]))
print(type(my_list[4]))

